tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
# Open-source formatting library for C++
brew "fmt"
# Next generation open source RPC library and framework
brew "grpc"
# Super fast C++ logging library
brew "spdlog"
# Generate compilation database for clang tooling
brew "bear"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Small git utilities
brew "git-extras"
# Command-line interface for SQLite
brew "sqlite"
# Maintained ctags implementation
brew "universal-ctags"
# Source code tag system
brew "global"
# OpenType text shaping engine
brew "harfbuzz"
# Post-modern modal text editor
brew "helix"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Next-gen compiler infrastructure
brew "llvm"
# Mac App Store command-line interface
brew "mas"
# Create modern online books from Markdown files
brew "mdbook"
# Rich and complete approach to parallelism in C++
brew "tbb"
# Modern Linker
brew "mold"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Platform built on V8 to build network applications
brew "node@16"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Emulator for x86 and PowerPC
brew "qemu"
# Used as a compiler wrapper and avoids compilation when possible
brew "sccache"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# GPU-accelerated terminal emulator
cask "alacritty"
# Memory training application
cask "anki"
cask "baiduinput"
# Cloud storage service
cask "baidunetdisk"
# Virtual Audio Driver
cask "blackhole-2ch"
# E-books management software
cask "calibre"
# Voice and text chat software
cask "discord"
# Social software for creating music short videos
cask "douyin"
# European dictionary
cask "eudic"
# Typeface made for developers
cask "font-jetbrains-mono"
# Web browser
cask "google-chrome"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# Quicklook extension for source files
cask "syntax-highlight"
# Configurable document editor that supports Markdown
cask "typora"
# Virtualizer for x86 hardware
cask "virtualbox"
# Free messaging and calling application
cask "wechat"
# Allows access to WWDC livestreams, videos and sessions
cask "wwdc"
# Multiplayer code editor
cask "zed"
mas "AdBlock", id: 1402042596
mas "AdGuard for Safari", id: 1440147259
mas "AutoSwitchInput Pro", id: 1551531632
mas "Cinebench", id: 1438772273
mas "Compressor", id: 424390742
mas "Final Cut Pro", id: 424389933
mas "Flow", id: 1423210932
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Microsoft To Do", id: 1274495053
mas "Numbers", id: 409203825
mas "Octotree", id: 1457450145
mas "Pages", id: 409201541
mas "PDF Expert", id: 1055273043
mas "The Unarchiver", id: 425424353
mas "Trello", id: 1278508951
mas "WPS Office", id: 1443749478
mas "Xnip", id: 1221250572
mas "每日英语听力", id: 734383760
mas "腾讯视频", id: 1231336508
vscode "13xforever.language-x86-64-assembly"
vscode "aaron-bond.better-comments"
vscode "AbdAlMoniem-AlHifnawy.c-call-hierarchy"
vscode "Adaptilab.grok"
vscode "andrejunges.Handlebars"
vscode "antfu.slidev"
vscode "chanhx.crabviz"
vscode "christian-kohler.path-intellisense"
vscode "Codeium.codeium"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "cweijan.vscode-office"
vscode "deerawan.vscode-dash"
vscode "deerawan.vscode-faker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "fredericbonnet.cmake-test-adapter"
vscode "github.classroom"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-labs"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "GitHub.vscode-pull-request-github"
vscode "Gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.debug-visualizer"
vscode "IBM.output-colorizer"
vscode "JacquesLucke.gcov-viewer"
vscode "jaycetyle.vscode-gnu-global"
vscode "kdl-org.kdl"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "llvm-vs-code-extensions.vscode-mlir"
vscode "LucianIrsigler.nasm"
vscode "LuoZhihao.call-graph"
vscode "mads-hartmann.bash-ide-vscode"
vscode "maelvalais.autoconf"
vscode "matepek.vscode-catch2-test-adapter"
vscode "miki0w0.c-hierarchy"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "naumovs.color-highlight"
vscode "pnp.polacode"
vscode "pomdtr.excalidraw-editor"
vscode "quicktype.quicktype"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "Remisa.shellman"
vscode "rights.nas-vscode"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sleistner.vscode-fileutils"
vscode "SonarSource.sonarlint-vscode"
vscode "spmeesseman.vscode-taskexplorer"
vscode "Swellaby.vscode-rust-test-adapter"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "Tyriar.luna-paint"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vsls-contrib.codetour"
vscode "WakaTime.vscode-wakatime"
vscode "wayou.vscode-todo-highlight"
vscode "withfig.fig"
vscode "yzhang.dictionary-completion"
vscode "yzhang.markdown-all-in-one"
vscode "zhwu95.riscv"
vscode "ZixuanWang.linkerscript"
vscode "zxh404.vscode-proto3"
